/* automatically generated by rust-bindgen 0.64.0 */

pub type bo_t = bo;
pub type rga_rect_t = rga_rect;
pub type rga_nn_t = rga_nn;
pub type rga_dither_t = rga_dither;
pub type rga_info_t = rga_info;
pub type drm_rga_t = drm_rga;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rga_img_info_t {
    pub yrgb_addr: u64,
    pub uv_addr: u64,
    pub v_addr: u64,
    pub format: u32,
    pub act_w: u16,
    pub act_h: u16,
    pub x_offset: u16,
    pub y_offset: u16,
    pub vir_w: u16,
    pub vir_h: u16,
    pub endian_mode: u16,
    pub alpha_swap: u16,
    pub rotate_mode: u16,
    pub rd_mode: u16,
    pub is_10b_compact: u16,
    pub is_10b_endian: u16,
    pub enable: u16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct POINT {
    pub x: u16,
    pub y: u16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct RECT {
    pub xmin: u16,
    pub xmax: u16,
    pub ymin: u16,
    pub ymax: u16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct MMU {
    pub mmu_en: u8,
    pub base_addr: u64,
    pub mmu_flag: u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct COLOR_FILL {
    pub gr_x_a: i16,
    pub gr_y_a: i16,
    pub gr_x_b: i16,
    pub gr_y_b: i16,
    pub gr_x_g: i16,
    pub gr_y_g: i16,
    pub gr_x_r: i16,
    pub gr_y_r: i16,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct FADING {

#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct rga_dither {
    pub enable: ::std::os::raw::c_int,
    pub mode: ::std::os::raw::c_int,
    pub lut0_l: ::std::os::raw::c_int,
    pub lut0_h: ::std::os::raw::c_int,
    pub lut1_l: ::std::os::raw::c_int,
    pub lut1_h: ::std::os::raw::c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct rga_info {
    pub fd: ::std::os::raw::c_int,
    pub virAddr: *mut ::std::os::raw::c_void,
    pub phyAddr: *mut ::std::os::raw::c_void,
    pub hnd: ::std::os::raw::c_uint,
    pub format: ::std::os::raw::c_int,
    pub rect: rga_rect_t,
    pub blend: ::std::os::raw::c_uint,
    pub bufferSize: ::std::os::raw::c_int,
    pub rotation: ::std::os::raw::c_int,
    pub color: ::std::os::raw::c_int,
    pub testLog: ::std::os::raw::c_int,
    pub mmuFlag: ::std::os::raw::c_int,
    pub colorkey_en: ::std::os::raw::c_int,
    pub colorkey_mode: ::std::os::raw::c_int,
    pub colorkey_max: ::std::os::raw::c_int,
    pub colorkey_min: ::std::os::raw::c_int,
    pub scale_mode: ::std::os::raw::c_int,
    pub color_space_mode: ::std::os::raw::c_int,
    pub sync_mode: ::std::os::raw::c_int,
    pub nn: rga_nn_t,
    pub dither: rga_dither_t,
    pub rop_code: ::std::os::raw::c_int,
    pub rd_mode: ::std::os::raw::c_int,
    pub is_10b_compact: ::std::os::raw::c_ushort,
    pub is_10b_endian: ::std::os::raw::c_ushort,
    pub in_fence_fd: ::std::os::raw::c_int,
    pub out_fence_fd: ::std::os::raw::c_int,
    pub core: ::std::os::raw::c_int,
    pub priority: ::std::os::raw::c_int,
    pub enable: ::std::os::raw::c_ushort,
    pub handle: ::std::os::raw::c_int,
    pub mosaic_info: rga_mosaic_info,
    pub osd_info: rga_osd_info,
    pub pre_intr: rga_pre_intr_info,
    pub mpi_mode: ::std::os::raw::c_int,
    pub ctx_id: ::std::os::raw::c_int,
    pub reserve: [::std::os::raw::c_char; 402usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq, Eq)]
pub struct drm_rga {
    pub src: rga_rect_t,
    pub dst: rga_rect_t,
}
pub const RGA_IOC_MAGIC: u8 = 114u8;
pub const RGA_BLIT_SYNC: u32 = 20503;
pub const RGA_BLIT_ASYNC: u32 = 20504;
pub const RGA_FLUSH: u32 = 20505;
pub const RGA_GET_RESULT: u32 = 20506;
pub const RGA_GET_VERSION: u32 = 20507;
pub const RGA_REG_CTRL_LEN: u32 = 8;
pub const RGA_REG_CMD_LEN: u32 = 28;
pub const RGA_CMD_BUF_SIZE: u32 = 1792;
pub const RGA_SCHED_PRIORITY_DEFAULT: u32 = 0;
pub const RGA_SCHED_PRIORITY_MAX: u32 = 6;
pub const RGA_VERSION_SIZE: u32 = 16;
pub const RGA_HW_SIZE: u32 = 5;
pub const HAL_TRANSFORM_FLIP_H: u32 = 1;
pub const HAL_TRANSFORM_FLIP_V: u32 = 2;
pub const HAL_TRANSFORM_ROT_90: u32 = 4;
pub const HAL_TRANSFORM_ROT_180: u32 = 3;
pub const HAL_TRANSFORM_ROT_270: u32 = 7;
pub const HAL_TRANSFORM_FLIP_H_V: u32 = 8;
#[test]
fn bindgen_test_layout_rga_img_info_t() {
    const UNINIT: ::std::mem::MaybeUninit<rga_img_info_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_img_info_t>(),
        56usize,
        concat!("Size of: ", stringify!(rga_img_info_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_img_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_img_info_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yrgb_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(yrgb_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uv_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(uv_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v_addr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(v_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).act_w) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(act_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).act_h) as usize - ptr as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(act_h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_offset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(x_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y_offset) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(y_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vir_w) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(vir_w)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vir_h) as usize - ptr as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(vir_h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endian_mode) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(endian_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_swap) as usize - ptr as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(alpha_swap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotate_mode) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(rotate_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rd_mode) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(rd_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_10b_compact) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(is_10b_compact)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_10b_endian) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(is_10b_endian)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_img_info_t),
            "::",
            stringify!(enable)
        )
    );
}
#[test]
fn bindgen_test_layout_POINT() {
    const UNINIT: ::std::mem::MaybeUninit<POINT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<POINT>(),
        4usize,
        concat!("Size of: ", stringify!(POINT))
    );
    assert_eq!(
        ::std::mem::align_of::<POINT>(),
        2usize,
        concat!("Alignment of ", stringify!(POINT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(POINT), "::", stringify!(x))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(POINT), "::", stringify!(y))
    );
}
#[test]
fn bindgen_test_layout_RECT() {
    const UNINIT: ::std::mem::MaybeUninit<RECT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<RECT>(),
        8usize,
        concat!("Size of: ", stringify!(RECT))
    );
    assert_eq!(
        ::std::mem::align_of::<RECT>(),
        2usize,
        concat!("Alignment of ", stringify!(RECT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(RECT),
            "::",
            stringify!(xmin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xmax) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(RECT),
            "::",
            stringify!(xmax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ymin) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(RECT),
            "::",
            stringify!(ymin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ymax) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(RECT),
            "::",
            stringify!(ymax)
        )
    );
}
#[test]
fn bindgen_test_layout_MMU() {
    const UNINIT: ::std::mem::MaybeUninit<MMU> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MMU>(),
        24usize,
        concat!("Size of: ", stringify!(MMU))
    );
    assert_eq!(
        ::std::mem::align_of::<MMU>(),
        8usize,
        concat!("Alignment of ", stringify!(MMU))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mmu_en) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MMU),
            "::",
            stringify!(mmu_en)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MMU),
            "::",
            stringify!(base_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mmu_flag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MMU),
            "::",
            stringify!(mmu_flag)
        )
    );
}
#[test]
fn bindgen_test_layout_COLOR_FILL() {
    const UNINIT: ::std::mem::MaybeUninit<COLOR_FILL> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<COLOR_FILL>(),
        16usize,
        concat!("Size of: ", stringify!(COLOR_FILL))
    );
    assert_eq!(
        ::std::mem::align_of::<COLOR_FILL>(),
        2usize,
        concat!("Alignment of ", stringify!(COLOR_FILL))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_x_a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_x_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_y_a) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_y_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_x_b) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_x_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_y_b) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_y_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_x_g) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_x_g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_y_g) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_y_g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_x_r) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_x_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_y_r) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(COLOR_FILL),
            "::",
            stringify!(gr_y_r)
        )
    );
}
#[test]
fn bindgen_test_layout_FADING() {
    const UNINIT: ::std::mem::MaybeUninit<FADING> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<FADING>(),
        4usize,
        concat!("Size of: ", stringify!(FADING))
    );
    assert_eq!(
        ::std::mem::align_of::<FADING>(),
        1usize,
        concat!("Alignment of ", stringify!(FADING))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(FADING), "::", stringify!(b))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        1usize,
        concat!("Offset of field: ", stringify!(FADING), "::", stringify!(g))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        2usize,
        concat!("Offset of field: ", stringify!(FADING), "::", stringify!(r))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).res) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(FADING),
            "::",
            stringify!(res)
        )
    );
}
#[test]
fn bindgen_test_layout_line_draw_t() {
    const UNINIT: ::std::mem::MaybeUninit<line_draw_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<line_draw_t>(),
        20usize,
        concat!("Size of: ", stringify!(line_draw_t))
    );
    assert_eq!(
        ::std::mem::align_of::<line_draw_t>(),
        4usize,
        concat!("Alignment of ", stringify!(line_draw_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_point) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(line_draw_t),
            "::",
            stringify!(start_point)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_point) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(line_draw_t),
            "::",
            stringify!(end_point)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(line_draw_t),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(line_draw_t),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_width) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(line_draw_t),
            "::",
            stringify!(line_width)
        )
    );
}
#[test]
fn bindgen_test_layout_csc_coe_t() {
    const UNINIT: ::std::mem::MaybeUninit<csc_coe_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<csc_coe_t>(),
        12usize,
        concat!("Size of: ", stringify!(csc_coe_t))
    );
    assert_eq!(
        ::std::mem::align_of::<csc_coe_t>(),
        4usize,
        concat!("Alignment of ", stringify!(csc_coe_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_v) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(csc_coe_t),
            "::",
            stringify!(r_v)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g_y) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(csc_coe_t),
            "::",
            stringify!(g_y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b_u) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(csc_coe_t),
            "::",
            stringify!(b_u)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).off) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(csc_coe_t),
            "::",
            stringify!(off)
        )
    );
}
#[test]
fn bindgen_test_layout_full_csc_t() {
    const UNINIT: ::std::mem::MaybeUninit<full_csc_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<full_csc_t>(),
        40usize,
        concat!("Size of: ", stringify!(full_csc_t))
    );
    assert_eq!(
        ::std::mem::align_of::<full_csc_t>(),
        4usize,
        concat!("Alignment of ", stringify!(full_csc_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(full_csc_t),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coe_y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(full_csc_t),
            "::",
            stringify!(coe_y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coe_u) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(full_csc_t),
            "::",
            stringify!(coe_u)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coe_v) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(full_csc_t),
            "::",
            stringify!(coe_v)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_mosaic_info() {
    const UNINIT: ::std::mem::MaybeUninit<rga_mosaic_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_mosaic_info>(),
        2usize,
        concat!("Size of: ", stringify!(rga_mosaic_info))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_mosaic_info>(),
        1usize,
        concat!("Alignment of ", stringify!(rga_mosaic_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_mosaic_info),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_mosaic_info),
            "::",
            stringify!(mode)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_pre_intr_info() {
    const UNINIT: ::std::mem::MaybeUninit<rga_pre_intr_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_pre_intr_info>(),
        16usize,
        concat!("Size of: ", stringify!(rga_pre_intr_info))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_pre_intr_info>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_pre_intr_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_intr_en) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(read_intr_en)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_intr_en) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(write_intr_en)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_hold_en) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(read_hold_en)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_threshold) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(read_threshold)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(write_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_step) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_pre_intr_info),
            "::",
            stringify!(write_step)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_invert_factor() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_invert_factor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_invert_factor>(),
        6usize,
        concat!("Size of: ", stringify!(rga_osd_invert_factor))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_invert_factor>(),
        1usize,
        concat!("Alignment of ", stringify!(rga_osd_invert_factor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_max) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_invert_factor),
            "::",
            stringify!(alpha_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_min) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_invert_factor),
            "::",
            stringify!(alpha_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yg_max) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_invert_factor),
            "::",
            stringify!(yg_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yg_min) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_invert_factor),
            "::",
            stringify!(yg_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crb_max) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_invert_factor),
            "::",
            stringify!(crb_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crb_min) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_invert_factor),
            "::",
            stringify!(crb_min)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_color__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rga_color__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_color__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(rga_color__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rga_color__bindgen_ty_1__bindgen_ty_1>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(rga_color__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).red) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_color__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).green) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_color__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blue) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_color__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_color__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(alpha)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_color__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rga_color__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_color__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(rga_color__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_color__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_color__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_color__bindgen_ty_1),
            "::",
            stringify!(value)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_color() {
    assert_eq!(
        ::std::mem::size_of::<rga_color>(),
        4usize,
        concat!("Size of: ", stringify!(rga_color))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_color>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_color))
    );
}
#[test]
fn bindgen_test_layout_rga_osd_bpp2() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_bpp2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_bpp2>(),
        12usize,
        concat!("Size of: ", stringify!(rga_osd_bpp2))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_bpp2>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_osd_bpp2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ac_swap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_bpp2),
            "::",
            stringify!(ac_swap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endian_swap) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_bpp2),
            "::",
            stringify!(endian_swap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_bpp2),
            "::",
            stringify!(color0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_bpp2),
            "::",
            stringify!(color1)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_mode_ctrl() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_mode_ctrl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_mode_ctrl>(),
        18usize,
        concat!("Size of: ", stringify!(rga_osd_mode_ctrl))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_mode_ctrl>(),
        2usize,
        concat!("Alignment of ", stringify!(rga_osd_mode_ctrl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).direction_mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(direction_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width_mode) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(width_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block_fix_width) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(block_fix_width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).block_num) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(block_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags_index) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(flags_index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_mode) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(color_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invert_flags_mode) as usize - ptr as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(invert_flags_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).default_color_sel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(default_color_sel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invert_enable) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(invert_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invert_mode) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(invert_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invert_thresh) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(invert_thresh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unfix_index) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_mode_ctrl),
            "::",
            stringify!(unfix_index)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_info__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_info__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_info__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(rga_osd_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_info__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(rga_osd_info__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_flags1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(last_flags1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_flags0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(last_flags0)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_info__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_info__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_info__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(rga_osd_info__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_info__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_osd_info__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info__bindgen_ty_1),
            "::",
            stringify!(last_flags)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_info__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_info__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_info__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(rga_osd_info__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_info__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(rga_osd_info__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_flags1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(cur_flags1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_flags0) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(cur_flags0)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_info__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_info__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_info__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(rga_osd_info__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_info__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_osd_info__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cur_flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info__bindgen_ty_2),
            "::",
            stringify!(cur_flags)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_osd_info() {
    const UNINIT: ::std::mem::MaybeUninit<rga_osd_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_osd_info>(),
        56usize,
        concat!("Size of: ", stringify!(rga_osd_info))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_osd_info>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_osd_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode_ctrl) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info),
            "::",
            stringify!(mode_ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cal_factor) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info),
            "::",
            stringify!(cal_factor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpp2_info) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_osd_info),
            "::",
            stringify!(bpp2_info)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_version_t() {
    const UNINIT: ::std::mem::MaybeUninit<rga_version_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_version_t>(),
        28usize,
        concat!("Size of: ", stringify!(rga_version_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_version_t>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_version_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).major) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_version_t),
            "::",
            stringify!(major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minor) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_version_t),
            "::",
            stringify!(minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).revision) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_version_t),
            "::",
            stringify!(revision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).str_) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_version_t),
            "::",
            stringify!(str_)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_hw_versions_t() {
    const UNINIT: ::std::mem::MaybeUninit<rga_hw_versions_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_hw_versions_t>(),
        144usize,
        concat!("Size of: ", stringify!(rga_hw_versions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_hw_versions_t>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_hw_versions_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_hw_versions_t),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_hw_versions_t),
            "::",
            stringify!(size)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_memory_parm() {
    const UNINIT: ::std::mem::MaybeUninit<rga_memory_parm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_memory_parm>(),
        16usize,
        concat!("Size of: ", stringify!(rga_memory_parm))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_memory_parm>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_memory_parm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_memory_parm),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_memory_parm),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_memory_parm),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_memory_parm),
            "::",
            stringify!(size)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_external_buffer() {
    const UNINIT: ::std::mem::MaybeUninit<rga_external_buffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_external_buffer>(),
        288usize,
        concat!("Size of: ", stringify!(rga_external_buffer))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_external_buffer>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_external_buffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).memory) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_external_buffer),
            "::",
            stringify!(memory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_external_buffer),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_external_buffer),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).memory_info) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_external_buffer),
            "::",
            stringify!(memory_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_external_buffer),
            "::",
            stringify!(reserve)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_buffer_pool() {
    const UNINIT: ::std::mem::MaybeUninit<rga_buffer_pool> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_buffer_pool>(),
        16usize,
        concat!("Size of: ", stringify!(rga_buffer_pool))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_buffer_pool>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_buffer_pool))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).buffers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_buffer_pool),
            "::",
            stringify!(buffers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_buffer_pool),
            "::",
            stringify!(size)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_req() {
    const UNINIT: ::std::mem::MaybeUninit<rga_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_req>(),
        504usize,
        concat!("Size of: ", stringify!(rga_req))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_req>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).render_mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(render_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pat) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(pat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rop_mask_addr) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(rop_mask_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LUT_addr) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(LUT_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clip) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(clip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sina) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(sina)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cosa) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(cosa)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_rop_flag) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(alpha_rop_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_mode) as usize - ptr as usize },
        210usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(scale_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_key_max) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(color_key_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_key_min) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(color_key_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fg_color) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(fg_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bg_color) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(bg_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_color) as usize - ptr as usize },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(gr_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).line_draw_info) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(line_draw_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fading) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(fading)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).PD_mode) as usize - ptr as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(PD_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_global_value) as usize - ptr as usize },
        269usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(alpha_global_value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rop_code) as usize - ptr as usize },
        270usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(rop_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bsfilter_flag) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(bsfilter_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).palette_mode) as usize - ptr as usize },
        273usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(palette_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yuv2rgb_mode) as usize - ptr as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(yuv2rgb_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).endian_mode) as usize - ptr as usize },
        275usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(endian_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotate_mode) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(rotate_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_fill_mode) as usize - ptr as usize },
        277usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(color_fill_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mmu_info) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(mmu_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alpha_rop_mode) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(alpha_rop_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src_trans_mode) as usize - ptr as usize },
        305usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(src_trans_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dither_mode) as usize - ptr as usize },
        306usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(dither_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).full_csc) as usize - ptr as usize },
        308usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(full_csc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).in_fence_fd) as usize - ptr as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(in_fence_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(core)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        353usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).out_fence_fd) as usize - ptr as usize },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(out_fence_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle_flag) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(handle_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mosaic_info) as usize - ptr as usize },
        361usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(mosaic_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uvhds_mode) as usize - ptr as usize },
        363usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(uvhds_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uvvds_mode) as usize - ptr as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(uvvds_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).osd_info) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(osd_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_intr_info) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(pre_intr_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reservr) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_req),
            "::",
            stringify!(reservr)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_user_ctx_t() {
    const UNINIT: ::std::mem::MaybeUninit<rga_user_ctx_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_user_ctx_t>(),
        152usize,
        concat!("Size of: ", stringify!(rga_user_ctx_t))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_user_ctx_t>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_user_ctx_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmd_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(cmd_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmd_num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(cmd_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync_mode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(sync_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).out_fence_fd) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(out_fence_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mpi_config_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(mpi_config_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reservr) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_user_ctx_t),
            "::",
            stringify!(reservr)
        )
    );
}
#[test]
fn bindgen_test_layout_bo() {
    const UNINIT: ::std::mem::MaybeUninit<bo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bo>(),
        48usize,
        concat!("Size of: ", stringify!(bo))
    );
    assert_eq!(
        ::std::mem::align_of::<bo>(),
        8usize,
        concat!("Alignment of ", stringify!(bo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(bo), "::", stringify!(fd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(bo), "::", stringify!(ptr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!("Offset of field: ", stringify!(bo), "::", stringify!(size))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(bo),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pitch) as usize - ptr as usize },
        32usize,
        concat!("Offset of field: ", stringify!(bo), "::", stringify!(pitch))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(bo),
            "::",
            stringify!(handle)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_rect() {
    const UNINIT: ::std::mem::MaybeUninit<rga_rect> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_rect>(),
        32usize,
        concat!("Size of: ", stringify!(rga_rect))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_rect>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_rect))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).xoffset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(xoffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).yoffset) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(yoffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).wstride) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(wstride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hstride) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(hstride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_rect),
            "::",
            stringify!(size)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_nn() {
    const UNINIT: ::std::mem::MaybeUninit<rga_nn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_nn>(),
        28usize,
        concat!("Size of: ", stringify!(rga_nn))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_nn>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_nn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nn_flag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(nn_flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_r) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(scale_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_g) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(scale_g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_b) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(scale_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset_r) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(offset_r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset_g) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(offset_g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset_b) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_nn),
            "::",
            stringify!(offset_b)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_dither() {
    const UNINIT: ::std::mem::MaybeUninit<rga_dither> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_dither>(),
        24usize,
        concat!("Size of: ", stringify!(rga_dither))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_dither>(),
        4usize,
        concat!("Alignment of ", stringify!(rga_dither))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_dither),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_dither),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lut0_l) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_dither),
            "::",
            stringify!(lut0_l)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lut0_h) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_dither),
            "::",
            stringify!(lut0_h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lut1_l) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_dither),
            "::",
            stringify!(lut1_l)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lut1_h) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_dither),
            "::",
            stringify!(lut1_h)
        )
    );
}
#[test]
fn bindgen_test_layout_rga_info() {
    const UNINIT: ::std::mem::MaybeUninit<rga_info> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<rga_info>(),
        696usize,
        concat!("Size of: ", stringify!(rga_info))
    );
    assert_eq!(
        ::std::mem::align_of::<rga_info>(),
        8usize,
        concat!("Alignment of ", stringify!(rga_info))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fd) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).virAddr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(virAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).phyAddr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(phyAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hnd) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(hnd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rect) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(rect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blend) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(blend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bufferSize) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(bufferSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rotation) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).testLog) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(testLog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mmuFlag) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(mmuFlag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorkey_en) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(colorkey_en)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorkey_mode) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(colorkey_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorkey_max) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(colorkey_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorkey_min) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(colorkey_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale_mode) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(scale_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color_space_mode) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(color_space_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sync_mode) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(sync_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nn) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(nn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dither) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(dither)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rop_code) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(rop_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rd_mode) as usize - ptr as usize },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(rd_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_10b_compact) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(is_10b_compact)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).is_10b_endian) as usize - ptr as usize },
        178usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(is_10b_endian)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).in_fence_fd) as usize - ptr as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(in_fence_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).out_fence_fd) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(out_fence_fd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).core) as usize - ptr as usize },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(core)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mosaic_info) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(mosaic_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).osd_info) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(osd_info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pre_intr) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(pre_intr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mpi_mode) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(mpi_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctx_id) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(ctx_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(rga_info),
            "::",
            stringify!(reserve)
        )
    );
}
#[test]
fn bindgen_test_layout_drm_rga() {
    const UNINIT: ::std::mem::MaybeUninit<drm_rga> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drm_rga>(),
        64usize,
        concat!("Size of: ", stringify!(drm_rga))
    );
    assert_eq!(
        ::std::mem::align_of::<drm_rga>(),
        4usize,
        concat!("Alignment of ", stringify!(drm_rga))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).src) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drm_rga),
            "::",
            stringify!(src)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(drm_rga),
            "::",
            stringify!(dst)
        )
    );
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum rga_memory_type {
    RGA_DMA_BUFFER = 0,
    RGA_VIRTUAL_ADDRESS = 1,
    RGA_PHYSICAL_ADDRESS = 2,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum _Rga_SURF_FORMAT {
    RK_FORMAT_RGBA_8888 = 0,
    RK_FORMAT_RGBX_8888 = 256,
    RK_FORMAT_RGB_888 = 512,
    RK_FORMAT_BGRA_8888 = 768,
    RK_FORMAT_RGB_565 = 1024,
    RK_FORMAT_RGBA_5551 = 1280,
    RK_FORMAT_RGBA_4444 = 1536,
    RK_FORMAT_BGR_888 = 1792,
    RK_FORMAT_YCbCr_422_SP = 2048,
    RK_FORMAT_YCbCr_422_P = 2304,
    RK_FORMAT_YCbCr_420_SP = 2560,
    RK_FORMAT_YCbCr_420_P = 2816,
    RK_FORMAT_YCrCb_422_SP = 3072,
    RK_FORMAT_YCrCb_422_P = 3328,
    RK_FORMAT_YCrCb_420_SP = 3584,
    RK_FORMAT_YCrCb_420_P = 3840,
    RK_FORMAT_BPP1 = 4096,
    RK_FORMAT_BPP2 = 4352,
    RK_FORMAT_BPP4 = 4608,
